georgik/esp32-swift-weather-display/sdkconfig.defaults.esp32_c3_lcdkit
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BSP_LCD_RGB_BUFFER_NUMS=2
CONFIG_BSP_LCD_RGB_BOUNCE_BUFFER_MODE=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8912
CONFIG_ESP_DEBUG_INCLUDE_OCD_STUB_BINS=n
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=10

